app/Controllers/Produtos.php

SELECT *
FROM `produtos`
---
    public function ListarTabela()
    {
        $data = $this->produtosModel->findAll();

SELECT *
FROM `produtos`
 LIMIT 3
---
    public function ultProdutos()
    {
        $data = $this->produtosModel->findAll(3);