app/Models/ProdutosModel.php

    public function getProduto($id){
        return $this->asArray()->where(['id'=>$id])->first();
---
SELECT *
FROM `produtos`
WHERE `id` = '6'
 LIMIT 1